Version2/TestTool/TestTool.Setup/Requests/ImagingConf/SetImagingSettings/TC.IC.NVT.02_REQ_25.xml

<?xml version='1.0' encoding='utf-8'?>
<s:Envelope
 xmlns:s="http://www.w3.org/2003/05/soap-envelope"
 xmlns:timg="http://www.onvif.org/ver10/imaging/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <s:Body>
    <timg:SetImagingSettings>
      <timg:VideoSourceToken>cam1</timg:VideoSourceToken>
      <timg:ImagingSettings>
        <tt:Focus>
          <!-- Attribute Wild card could not be matched. Generated XML may not be valid. -->
          <tt:AutoFocusMode>AUTO</tt:AutoFocusMode>
          <tt:DefaultSpeed>1</tt:DefaultSpeed>
          <tt:NearLimit>1</tt:NearLimit>
          <tt:FarLimit>1</tt:FarLimit>
        </tt:Focus>
      </timg:ImagingSettings>
    </timg:SetImagingSettings>
  </s:Body>
</s:Envelope>